* Request <2018-04-05 Thu> from gigio.
  :LOGBOOK:
  CLOCK: [2018-04-06 Fri 15:00]--[2018-04-06 Fri 16:15] =>  1:15
  CLOCK: [2018-04-05 Thu 15:00]--[2018-04-05 Thu 17:10] =>  2:10
  :END:

He'd like to try and tell which isoform of a few genes was being used in the C1 mouse limb data.

ENSMUSG00000020167
ENSMUSG00000032228
ENSMUSG00000063659
ENSMUSG00000030189

['ENSMUSG00000020167','ENSMUSG00000032228','ENSMUSG00000063659','ENSMUSG00000030189']

Wrote [[file:generate_combined_transcript_C1.py]] to generate his output file

* Request <2018-05-07 Mon> from Brian compare what's been submitted to what should be submitted.
[[file:compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods][compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods]] sheet should_be_submitted

Message-ID: <DM6PR03MB3515995D17F635F25D20E31FA0850@DM6PR03MB3515.namprd03.prod.outlook.com>

#+BEGIN_SRC python :results output
  import sys
  import pandas
  from pandasodf import ODFReader
  from htsworkflow.submission.encoded import ENCODED
  from requests.exceptions import  HTTPError

  def main():
      book = ODFReader('compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods')
      print(book.sheet_names)
      paper = book.parse('cells_in_paper')
      submitted = book.parse('should_be_submitted')

      server = ENCODED('www.encodeproject.org')

      paper_cells = set(paper['all_cells_in_manuscript'])
      submitted_cells = set(submitted['submitted_library_ids'])
      for cell in sorted(paper_cells.difference(submitted_cells)):
          alias = 'barbara-wold:{}'.format(cell)
          try:
             body = server.get_json(alias)
              state = ''
          except HTTPError as e:
              state = 'Not found'
          print('{},{}'.format(cell,state))

      #print('cells just in submitted set', ','.join(sorted(submitted_cells.difference(paper_cells))))

  if __name__ == '__main__':
      main()
#+END_SRC

#+RESULTS:
#+begin_example
['cells_in_paper', 'should_be_submitted']
17329_C4,Not found
17330_D12,Not found
17330_D9,Not found
17331_E8,Not found
17332_F1,Not found
17332_F3,Not found
17332_F6,Not found
17332_F7,Not found
17332_F8,Not found
17333_G2,Not found
17333_G6,Not found
17333_G9,Not found
17334_H1,Not found
17334_H3,Not found
17334_H7,Not found
18042_A12,Not found
18042_A4,Not found
18044_C11,Not found
18045_D11,Not found
18045_D2,Not found
18045_D6,Not found
18046_E9,Not found
18048_G10,Not found
18049_H5,Not found
18087_F9,Not found
18251_A2,Not found
18253_C5,Not found
18254_D11,Not found
18254_D5,Not found
18256_F5,Not found
18256_F8,Not found
18256_F9,Not found
18257_G5,Not found
18259_B8,Not found
18260_C11,Not found
18260_C2,Not found
18260_C6,Not found
18261_D3,Not found
18261_D5,Not found
18263_A12,Not found
18263_A4,Not found
18264_B3,Not found
18264_B4,Not found
18264_B8,Not found
18265_C10,Not found
18265_C4,Not found
18266_D1,Not found
18266_D6,Not found
18267_E10,Not found
18267_E3,Not found
18267_E4,Not found
18267_E6,Not found
18268_F1,Not found
18268_F12,Not found
18268_F3,Not found
18268_F7,Not found
18268_F8,Not found
18311_A4,Not found
18312_B4,Not found
18312_B5,Not found
18313_C1,Not found
18313_C10,Not found
18313_C11,Not found
18313_C12,Not found
18313_C5,Not found
18313_C7,Not found
18313_C8,Not found
18314_D2,Not found
18314_D3,Not found
18314_D4,Not found
18314_D7,Not found
18315_E12,Not found
18315_E2,Not found
18315_E4,Not found
18315_E6,Not found
18316_F1,Not found
18316_F10,Not found
18316_F11,Not found
18316_F5,Not found
18317_G3,Not found
18317_G4,Not found
18317_G7,Not found
18317_G8,Not found
18317_G9,Not found
#+end_example

Those were the libraries that weren't submitted...

However, Idan would prefer the whole thing to be replaced with the
newer pooled model.

Working on preparing submission, started altering
prepare_submission_20180430.py to support reading different files.

#+NAME run prepare submission
#+BEGIN_SRC bash
PYTHONPATH=/woldlab/loxcyc/home/diane/proj/htsworkflow:/woldlab/loxcyc/home/diane/src/pandasodf python3 \
  prepare_submission_20180430.py \
     --name submission-20180619 \
     --sheet cells_in_paper \
     --header 0 \
     compare_lists_submitted_cells_vs_cells_in_paper_May4_2018.ods
#+END_SRC

Unfortunately the mirror of htsworkflow is broken on felcat.


** Did we submit what we're supposed to?

| C1_e10.5_mouse_limb_run1_June6_2016            |  87 |
| C1_e10.5_mouse_limb_run2_June20_2016           |  56 |
| C1_e10.5_mouse_limb_run3_Dec5_2016             |  32 |
| C1_mouse_e11.0_limb_mesenchyme_mm10_run5       |  58 |
| C1_mouse_e11.5_limb_mesenchyme_mm10_run6       |  80 |
| C1_mouse_e12.5_limb_mesenchyme_mm10_run7       |  76 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run4       |  71 |
| C1_mouse_e13.5_limb_mesenchyme_mm10_run8       |  64 |
| C1_mouse_e10.5_forelimb_run15_January13AM_2018 |  18 |
| C1_mouse_e11.0_forelimb_run16_January13PM_2018 |  14 |
| C1_mouse_e11.5_forelimb_run10_December11_2017  |  77 |
| C1_mouse_e12.0_forelimb_run11_December12_2017  |  77 |
| C1_mouse_e13.0_forelimb_run12_December13_2017  |  72 |
| C1_mouse_e14.0_forelimb_run13_December14_2017  |  53 |
| C1_mouse_e14.5_forelimb_run17_January16_2018   |  27 |
| C1_mouse_e15.5_forelimb_run14_December15_2017  |  58 |
|                                                | 920 |
#+TBLFM: @17$2=vsum(@1$2..@16$2)

Paper sheet says 920 sum of aliases in tsvs sumbs to 920.
whew

** Barbara wants all the fastqs to be the same length. 50.

Built a set of submission metadata with "everything" included

#+BEGIN_SRC python :results output
import pandas
from pprint import pprint
df = pandas.read_csv('submission-20180928-flowcell-details.tsv', sep='\t')
pprint(set(df[df['read_length'] == 101]['experiment']))

#+END_SRC

#+RESULTS:
: {'C1_e10.5_mouse_limb_run3_Dec5_2016',
:  'C1_mouse_e13.5_limb_mesenchyme_mm10_run4',
:  'C1_mouse_e11.0_limb_mesenchyme_mm10_run5',
:  'C1_mouse_e11.5_limb_mesenchyme_mm10_run6',
:  'C1_mouse_e14.0_forelimb_run13_December14_2017'}

Those are the ones with 100 bp

* <2018-10-01 Mon> Jason found 5 experiments all labeled e13.5


| Experiment  | Description    | Date               |
| ENCSR311IKT | C1 e13.5 run 8 | September 26, 2018 |
| ENCSR839DYB | C1 e13.5 run 4 | September 28, 2018 |
| ENCSR787QXE | 10x            | January 29, 2018   |
| ENCSR530WGW | C1 e13.5 run 4 | July 1, 2017       |
| ENCSR255XZG | C1 e13.5 run 8 | June 30, 2017      |
|             |                |                    |

One of those is a 10x submission

two of those are the original many replicate submission, and two are
the new pooled submission.

The question is what, if any experiments should be merged together?

#+BEGIN_SRC python
  accessions = [
      'ENCSR723FBU', 'ENCSR062KGY', 'ENCSR559CDN', 'ENCSR881ZYX',
      'ENCSR182LFI', 'ENCSR652JLT', 'ENCSR839DYB', 'ENCSR311IKT',
      'ENCSR134JVO', 'ENCSR160DGP', 'ENCSR220RKA', 'ENCSR716HQB',
      'ENCSR182WHH', 'ENCSR938RJZ', 'ENCSR546KIB', 'ENCSR430OIC',
  ]

  from htsworkflow.submission.encoded import ENCODED

  server = ENCODED('www.encodeproject.org')
  server.load_netrc()

  results = []
  for accession in accessions:
      experiment = server.get_json(accession)
      for replicate in experiment['replicates']:
          library = replicate['library']
          biosample = library['biosample']
          results.append([
              accession,
              experiment['description'],
              library['accession'],
              biosample['accession'],
              biosample['date_obtained']])

  results = sorted(results, key=lambda x: x[1])
  results.insert(0, ['Experiment', 'Description', 'Library', 'Biosample', 'Date obtained'])
  return results
#+END_SRC

#+RESULTS:
| Experiment  | Description                    | Library     | Biosample   | Date obtained |
| ENCSR062KGY | C1 e10.5 mouse forelimb run 1  | ENCLB724RNK | ENCBS554MMC |    2016-06-06 |
| ENCSR723FBU | C1 e10.5 mouse forelimb run 2  | ENCLB971JGJ | ENCBS296NSC |    2016-06-20 |
| ENCSR559CDN | C1 e10.5 mouse forelimb run 3  | ENCLB864BFK | ENCBS439GGN |    2016-12-05 |
| ENCSR134JVO | C1 e10.5 mouse forelimb run 15 | ENCLB142PSQ | ENCBS183GJD |    2018-01-13 |
| ENCSR881ZYX | C1 e11.0 mouse forelimb run 5  | ENCLB442WTN | ENCBS661XMW |    2017-01-23 |
| ENCSR160DGP | C1 e11.0 mouse forelimb run 16 | ENCLB137HIJ | ENCBS790VEC |    2018-01-13 |
| ENCSR182LFI | C1 e11.5 mouse forelimb run 6  | ENCLB391AEB | ENCBS366ZCP |    2017-01-31 |
| ENCSR220RKA | C1 e11.5 mouse forelimb run 10 | ENCLB588VQM | ENCBS589YXS |    2017-12-11 |
| ENCSR716HQB | C1 e12.0 mouse forelimb run 11 | ENCLB685FNO | ENCBS875OEX |    2017-12-12 |
| ENCSR652JLT | C1 e12.5 mouse forelimb run 7  | ENCLB880HUG | ENCBS471HOV |    2017-02-01 |
| ENCSR182WHH | C1 e13.0 mouse forelimb run 12 | ENCLB573UWE | ENCBS800RRA |    2017-12-13 |
| ENCSR839DYB | C1 e13.5 mouse forelimb run 4  | ENCLB119UWL | ENCBS841DUB |    2017-01-19 |
| ENCSR311IKT | C1 e13.5 mouse forelimb run 8  | ENCLB948WTO | ENCBS306QOG |    2017-02-23 |
| ENCSR938RJZ | C1 e14.0 mouse forelimb run 13 | ENCLB812YXV | ENCBS621IQO |    2017-12-14 |
| ENCSR546KIB | C1 e14.5 mouse forelimb run 17 | ENCLB673LNA | ENCBS375BFM |    2018-01-16 |
| ENCSR430OIC | C1 e15.5 mouse forelimb run 14 | ENCLB736JSQ | ENCBS849XJR |    2017-12-15 |

After discussion it was decided it was best to leave them
separate. The dissections and library building work were done at
different times.

* <2018-10-01 Mon> Do we still have all the dagman files?

#+BEGIN_SRC python :results output
  import os
  from glob import glob
  from generate_combined_transcript_C1 import ASOF_RUN17_library_files

  commands = ['star_dir', 'rsem_dir']
  version_name = 'Version: '
  results = {}
  for name in ASOF_RUN17_library_files.split():
      name = name.strip()
      dirname, _ = os.path.split(os.path.expanduser(name))
      for dagman in glob(dirname + '/*.dagman'):
          with open(dagman, 'rt') as instream:
              for line in instream:
                  version = line.find(version_name)
                  if version >= 0:
                      version_id = line[version:].strip()
                      results.setdefault(dagman, {}).setdefault(version_name, set()).add(version_id)
                  for command in commands:
                      location = line.find(command)
                      if location >= 0:
                          path = line[location+len(command)+2: -2]
                          results.setdefault(dagman, {}).setdefault(command, set()).add(path)

          print(dagman)
          for command in commands:
              print('  ', results[dagman].get(command, ''))
          if version_name in results[dagman]:
              print('  ', results[dagman][version_name])

  #return results
#+END_SRC

#+RESULTS:
#+begin_example
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/rebuild-bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H5LV3BCXY/H5LV3BCXY.dagman
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/star/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/single-cell.dagman
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/star/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/rebuild-bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/loxcyc/home/diane/proj/C1_e10.5_mouse_limb_run3_Dec5_2016_2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/bin/Linux_x86_64/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run_mm10.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/rebuild_bam.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}

   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/run_mm10_clean.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/C1_mouse_limb_combined_Mar_2017/new_seed.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
/woldlab/castor/home/sau/flowcells/HFNLNBCX2/run_trim.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HFNLNBCX2/run-20090_C12.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/H7CNTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-32-g4adccc'}
/woldlab/castor/home/sau/flowcells/HFNLTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HF7NTBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
/woldlab/castor/home/sau/flowcells/HFNYNBCX2/run.dagman
   {'/woldlab/castor/proj/programs/STAR-2.5.2a/source/'}
   {'/woldlab/castor/home/diane/proj/long-rna-seq-pipeline/rsem/'}
   {'Version: 0.9-69-gf738e7'}
#+end_example

We have all of them.... though... then there's the problem telling
them apart.

Argh face palm. RELEASE_VERSION file wasn't being updated. Also that
commit id doesn't seem to exist anymore.


* <2018-10-09 Tue> I probably should match dagmans up to what quantifications went into the master table

I looked in [[file:generate_combined_C1.py::~sau/flowcells/H5LV3BCXY/C1_e10.5_mouse_limb_run1_June6_2016_FPKM.csv][generate_combined_C1.py]] for the list of FPKM files used
and we definitely used the run1 and run2 files that were generated
with STAR 2.4.0k

So... how different _are_ they?

[[file:compare_star_versions.py][compare_star_versions.py]]

So... how different is the same version of star?

#+BEGIN_SRC bash
for d in H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d
  for f in ~sau/flowcells/H5LV3BCXY/*.fastq.gz; do ln -s $f ; done
  cp ~sau/flowcells/H5LV3BCXY/library.tsv .
  cp ~sau/flowcells/H5LV3BCXY/experiments.tsv .
  tail -n +2 library.tsv | cut -f 2 | xargs mkdir
  PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
    python3 -m woldrnaseq.make_dag -l library.tsv > run.dagman
  popd
done
#+END_SRC

#+RESULTS:
| ~/proj/C1_mouse_limb_combined/H5LV3BCXY_2 | ~/proj/C1_mouse_limb_combined |
| ~/proj/C1_mouse_limb_combined             |                               |
| ~/proj/C1_mouse_limb_combined/H5LV3BCXY_3 | ~/proj/C1_mouse_limb_combined |
| ~/proj/C1_mouse_limb_combined             |                               |

#+BEGIN_SRC bash
for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
  for q in FPKM TPM expected_count; do
    PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
      python3 -m woldrnaseq.makersemcsv -l library.tsv -e experiments.tsv \
              -q ${q}
  done
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:

#+BEGIN_SRC bash
for q in FPKM TPM expected_count; do
  for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
    sha256sum C1_e10.5_mouse_limb_run1_June6_2016_gene_${q}.csv
  popd >> /dev/null
  done
done
#+END_SRC

#+RESULTS:
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| b64b9b263e10ebc6c15f616869d9793753b06d3461e61fe1aa32cdd9c6e5a470 | C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM.csv           |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| 8ea439e69727d441de54b6a2eec7dd316bedc821d2ff78459408ad2c4172e936 | C1_e10.5_mouse_limb_run1_June6_2016_gene_TPM.csv            |
| f069df455ff7c9b38eba5e86ec3d1ab71d145e4fdad512ae4cd38b8a7fa593fe | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
| 9ea2d2758cea6f668c06e3b15938ceb808512e413e80dfd1e338f7b8498f51ac | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
| 0b57e6111e7177fe2fdb22d471f09f695ec0f87b6e7e06bd6f5d977bdc159c09 | C1_e10.5_mouse_limb_run1_June6_2016_gene_expected_count.csv |
                                 C1_e10.5_mouse_limb_run1_June6_2016_gene_FPKM
Make sure run2 reproduces
#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016_2 C1_e10.5_mouse_limb_run2_June20_2016_3; do
  mkdir $d
  pushd $d >> /dev/null
  for f in ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/*.fastq.gz; do ln -s $f ; done
  cp ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/library.tsv .
  cp ~sau/flowcells/C1_e10.5_mouse_limb_run2_June20_2016/experiments.tsv .
  tail -n +2 library.tsv | cut -f 2 | xargs mkdir
  PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
    python3 -m woldrnaseq.make_dag -l library.tsv > run.dagman
  popd >> /dev/null
done
#+END_SRC

#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016 \
         C1_e10.5_mouse_limb_run2_June20_2016_2 \
         C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
  for q in FPKM TPM expected_count; do
    PYTHONPATH=~sau/flowcells/rna_pipelines/long-rna-seq-condor/ \
      python3 -m woldrnaseq.makersemcsv -l library.tsv -e all-in-one-experiment.tsv \
              -q $q
  done
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:


#+BEGIN_SRC bash
for q in FPKM TPM expected_count; do
  for d in C1_e10.5_mouse_limb_run2_June20_2016 \
           C1_e10.5_mouse_limb_run2_June20_2016_2 \
           C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
    sha256sum C1_e10.5_mouse_limb_run2_June20_2016_gene_${q}.csv
  popd >> /dev/null
  done
done
#+END_SRC

#+RESULTS:
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 166027605587ee167db523eb7a483b1f40f42f35573c38537f4976e98f94d001 | C1_e10.5_mouse_limb_run2_June20_2016_gene_FPKM.csv           |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 3bc1ba838e682edb1c37d16900c4a1f73b6451757490be07fa4d0a10938cbdf9 | C1_e10.5_mouse_limb_run2_June20_2016_gene_TPM.csv            |
| 7ecf2cb62bfe421260b6a9a1263855ff44c7797fee098cc17a47eeddef4d9cf5 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |
| 15b223b1f262dd5cbd81ef15c9d08657e38e0e14b2d56acd4cbd65cef1ef6612 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |
| 5f76acd9f0537898d496316adb755de95cc6f4ed6012a650377d7f454fd31d51 | C1_e10.5_mouse_limb_run2_June20_2016_gene_expected_count.csv |

Henry wondered if the ReadsPerGene.out.tab was reproducible
Run 1
#+BEGIN_SRC bash
for d in H5LV3BCXY H5LV3BCXY_2 H5LV3BCXY_3; do
  pushd $d >> /dev/null
  for a in $(find . -name ReadsPerGene.out.tab | sort); do sha256sum $a ; done | sha256sum
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |
| 684042af8299c2b2c0748db95f1d839adb9e7b780ad114959ed29f51989d0930 | 0 |

Run 2
#+BEGIN_SRC bash
for d in C1_e10.5_mouse_limb_run2_June20_2016 \
         C1_e10.5_mouse_limb_run2_June20_2016_2 \
         C1_e10.5_mouse_limb_run2_June20_2016_3; do
  pushd $d >> /dev/null
  for a in $(find . -name ReadsPerGene.out.tab | sort); do sha256sum $a ; done | sha256sum
  popd >> /dev/null
done
#+END_SRC

#+RESULTS:
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |
| 244e3574879f1ff59ef5584d680f1c12dbaa8eec24e383a04735265a582c4924 | 0 |


#+BEGIN_SRC python :results output
  import pandas
  import os

  df = pandas.read_csv('compare_bams_genome.csv', index_col=0)

  for column in df:
      data = df[column]
      if len(set(data)) > 1:
          print(column, set(data))

  print('done')

#+END_SRC

#+RESULTS:
: done

Implies that all of the genome alignments are reproducible

* Are all the expected bulk libraries present?
  <2018-10-15 Mon>

#+BEGIN_SRC python
  import pandas
  from htsworkflow.submission.encoded import ENCODED

  server = ENCODED('www.encodeproject.org')

  sheet = pandas.read_excel(
      'Mouse embryo samples list library numbers Diane August 21 2017.xlsx',
      dtype={'Library number': str,
             'biorep': str})

  status = []
  for library_id in sheet['Library number']:
      if not (pandas.isnull(library_id) or library_id == 'nan'):
          url = '/library/barbara-wold:{}/'.format(library_id)
          library = server.get_json(url)
          status.append((library['accession'], library['status']))

  return status

#+END_SRC

#+RESULTS:
| ENCLB029BTN | released |
| ENCLB286HEN | released |
| ENCLB257LEX | released |
| ENCLB396XZV | released |
| ENCLB554ZAM | released |
| ENCLB838FEJ | released |
| ENCLB293YOF | released |
| ENCLB247JXW | released |
| ENCLB564JOZ | released |
| ENCLB688RET | released |
| ENCLB537WPK | released |
| ENCLB682KXD | released |
| ENCLB835LVO | released |
| ENCLB471QMM | released |
| ENCLB659UFY | released |
| ENCLB426JKF | released |
| ENCLB454ZUS | released |
| ENCLB061TDP | released |
| ENCLB331VAA | released |
| ENCLB761PCA | released |
| ENCLB601XLL | released |
| ENCLB347FRI | released |
| ENCLB055KYV | released |
| ENCLB357KYA | released |
| ENCLB495FUZ | released |
| ENCLB979DZW | released |
| ENCLB162EJJ | released |
| ENCLB627LDZ | released |
| ENCLB204IPP | released |
| ENCLB214HEI | released |
| ENCLB839VOV | released |
| ENCLB187TEZ | released |
| ENCLB408EFI | released |
| ENCLB008IOE | released |
| ENCLB613DIH | released |
| ENCLB230FGL | released |
| ENCLB656OMB | released |
| ENCLB637CNF | released |
| ENCLB968JLC | released |
| ENCLB432GJF | released |
| ENCLB878ALV | released |
| ENCLB673NRF | released |
| ENCLB222KWY | released |
| ENCLB224ETE | released |
| ENCLB177SFU | released |
| ENCLB807ODU | released |
| ENCLB051RZO | released |
| ENCLB426MFX | released |
| ENCLB312IAF | released |
| ENCLB517UIN | released |
| ENCLB032PUJ | released |
| ENCLB304NDN | released |
| ENCLB690TFQ | released |
| ENCLB351WRP | released |
| ENCLB238AFW | released |
| ENCLB724HXC | released |
| ENCLB504REE | released |
| ENCLB863LLT | released |
| ENCLB302GKB | released |
| ENCLB327XFF | released |
| ENCLB336GOL | released |
| ENCLB964APA | released |
| ENCLB000EUQ | released |
| ENCLB597GRF | released |
| ENCLB989QNS | released |
| ENCLB567WFL | released |
| ENCLB254AMJ | released |
| ENCLB015WCJ | released |
| ENCLB200EFP | released |
| ENCLB278MMD | released |
| ENCLB819PZM | released |
| ENCLB220DVX | released |
| ENCLB906TKN | released |
| ENCLB949YQN | released |
| ENCLB584VFZ | released |
| ENCLB931ORG | released |
| ENCLB409LKR | released |
| ENCLB595PNG | released |
| ENCLB156EMG | released |
| ENCLB030NEC | released |
| ENCLB377PCX | released |
| ENCLB214UZM | released |
| ENCLB813BQB | released |
| ENCLB949WIO | released |
| ENCLB373ANW | released |
| ENCLB567JQE | released |
| ENCLB073YDX | released |
| ENCLB028XWK | released |
| ENCLB507CWD | released |
| ENCLB614EHD | released |
| ENCLB526KEI | released |
| ENCLB835IBO | released |
| ENCLB873UUE | released |
| ENCLB975KAO | released |
| ENCLB215FCS | released |
| ENCLB599UVX | released |
| ENCLB079XWZ | released |
| ENCLB042OTC | released |
| ENCLB753FMG | released |
| ENCLB110FBI | released |
| ENCLB783FQC | released |
| ENCLB209CGK | released |
| ENCLB646LEJ | released |
| ENCLB105VLP | released |
| ENCLB150ZJS | released |
| ENCLB256STD | released |
| ENCLB082UHO | released |
| ENCLB672ISU | released |
| ENCLB430WXG | released |
| ENCLB026UUS | released |
| ENCLB733PDT | released |
| ENCLB841PIC | released |
| ENCLB662TIG | released |
| ENCLB987VRV | released |
| ENCLB696ITY | released |
| ENCLB535BBV | released |
| ENCLB489BJY | released |
| ENCLB424YVG | released |
| ENCLB123VIC | released |
| ENCLB626WMA | released |
| ENCLB287BOO | released |
| ENCLB008KBU | released |
| ENCLB496KJW | released |
| ENCLB540BPI | released |
| ENCLB852NKM | released |
| ENCLB732ZDB | released |
| ENCLB266LCY | released |
| ENCLB055JUC | released |
| ENCLB080NNG | released |
| ENCLB180OTB | released |
| ENCLB274VUA | released |
| ENCLB441AFS | released |
| ENCLB790ZKD | released |
| ENCLB319NLX | released |
| ENCLB074REG | released |
| ENCLB415KPR | released |
| ENCLB658ICO | released |
| ENCLB741KQB | released |
| ENCLB810TRL | released |
| ENCLB544VIE | released |
| ENCLB370ZFK | released |
| ENCLB273BPC | released |
| ENCLB847UDV | released |
| ENCLB704CYQ | released |
| ENCLB318WHF | released |
| ENCLB590UZK | released |
| ENCLB260QNG | released |
| ENCLB817LXB | released |
| ENCLB169SNA | released |
| ENCLB459OYG | released |
| ENCLB217DSV | released |
| ENCLB159SLV | released |
| ENCLB022VFG | released |
| ENCLB416HZP | released |
| ENCLB556YSG | released |
| ENCLB803HJK | released |

